
#+TILE: Dr Henry Jones - Character Sheet

* Constants
  #+NAME: define-constants-with-src-block
  #+BEGIN_SRC elisp :var table=stats :colnames yes :results output drawer :cache yes :lang elisp
    (dnd-output-ability-constants table)
  #+END_SRC

  #+RESULTS[1aaa3cc5b3f3decca2c8592a17d38d734f239c96]: define-constants-with-src-block
  :results:
  #+CONSTANTS: STR=13
  #+CONSTANTS: DEX=12
  #+CONSTANTS: CON=10
  #+CONSTANTS: INT=15
  #+CONSTANTS: WIS=8
  #+CONSTANTS: CHA=14
  #+CONSTANTS: PROF=2
  #+CONSTANTS: SCA=
  #+CONSTANTS: SAM=
  :end:
  
* Traits
  | Level | Race  | Subrace | Class     | Subclass     | Age | Alignment    | Size             |
  |-------+-------+---------+-----------+--------------+-----+--------------+------------------|
  |    1  | Human | Variant | Artificer | Battle Smith |  37 | Chaotic Good | Medium(175) 6'1" |

* Stats  
  | Speed | Hit Points | AC | Throws        | Inspiration | Hit Die |
  |-------+------------+----+---------------+-------------+---------|
  |    30 |          8 | 14 | Save:  Death: |             |       1 |

* Abilities and Skills
  #+name: stats
  | Ability | Score | Mod | PB | Roll           | Skill                 |
  |---------+-------+-----+----+----------------+-----------------------|
  | STR     |    13 |   1 |    | 1d20 + 1       | Saving Throw          |
  |         |       |     |    | 1d20 + 1       | Athletics             |
  |---------+-------+-----+----+----------------+-----------------------|
  | DEX     |    12 |   1 |    | 1d20 + 1       | Saving Throw          |
  |         |       |     |    | 1d20 + 1       | Acrobatics            |
  |         |       |     | X  | 1d20 + 1       | Sleight of Hand       |
  |         |       |     |    | 1d20 + 1       | Stealth               |
  |---------+-------+-----+----+----------------+-----------------------|
  | CON     |    10 |   0 | X  | 1d20 + 2       | Saving Throw          |
  |---------+-------+-----+----+----------------+-----------------------|
  | INT     |    16 |   2 | X  | 1d20 + 4       | Saving Throw          |
  |         |       |     | X  | 1d20 + 2       | Arcana                |
  |         |       |     | X  | 1d20 + 2       | History               |
  |         |       |     |    | 1d20 + 2       | Investigation         |
  |         |       |     |    | 1d20 + 2       | Nature                |
  |         |       |     |    | 1d20 + 2       | Religion              |
  |---------+-------+-----+----+----------------+-----------------------|
  | WIS     |     8 |  -1 |    | 1d20 + -1      | Saving Throw          |
  |         |       |     |    | 1d20 + -1      | Animal Handling       |
  |         |       |     |    | 1d20 + -1      | Insight               |
  |         |       |     |    | 1d20 + -1      | Medicine              |
  |         |       |     | X  | 1d20 + -1      | Perception            |
  |         |       |     | X  | 1d20 + -1      | Survival              |
  |---------+-------+-----+----+----------------+-----------------------|
  | CHA     |    15 |   2 |    | 1d20 + 2       | Saving Throw          |
  |         |       |     |    | 1d20 + 2       | Deception             |
  |         |       |     |    | 1d20 + 2       | Intimidation          |
  |         |       |     |    | 1d20 + 2       | Performance           |
  |         |       |     |    | 1d20 + 2       | Persuasion            |
  |---------+-------+-----+----+----------------+-----------------------|
  | PROF    |     2 |     |    |                |                       |
  | SCA     |       |     |    | 8 + PROF + INT | SPELL CASTING ABILITY |
  | SAM     |       |     |    | PROF + INT     | SPELL ATT MOD         |
  #+TBLFM: @2$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @4$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @8$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @9$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @15$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @21$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @2$5..@3$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @2$1))))))
  #+TBLFM: @4$5..@7$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @4$1))))))
  #+TBLFM: @8$5..@8$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @8$1))))))
  #+TBLFM: @9$5..@14$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @9$1))))))
  #+TBLFM: @15$5..@20$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @15$1))))))
  #+TBLFM: @21$5..@25$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @21$1))))))
  
* Attacks
  #+NAME: attacks
  | Weapon          | Ability | Prof | Type     | Die | Mod To Hit | Roll    |
  |-----------------+---------+------+----------+-----+------------+---------|
  | Whip            | INT     | X    | Slashing | 1d4 |          4 | 1d4 + 2 |
  | Light Cross Bow | INT     | X    | Piercing | 1d8 |          4 | 1d8 + 2 |
  #+TBLFM: $6='(+ (if (string= $3 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant $2))))
  #+TBLFM: $7='(concat $5 " + " (number-to-string (calc-dnd-mod (string-to-number (org-table-get-constant $2)))))
 
* Proficiencies
  | Languages | Tools        | Armor   | Weapons    |
  |-----------+--------------+---------+------------|
  | Common    | Thieves      | Light   | Improvised |
  | Sylvan    | Tinkers      | Medium  | Simple     |
  | Dwarvish  | Cartographer | Shields | Martial    |
  |           | Smith        |         |            |

* Equipment
  | Name                     | Quantity | Cost (gp) | Weight (lbs) | Total Weight (lbs) | Total Cost (gp) |
  |--------------------------+----------+-----------+--------------+--------------------+-----------------|
  | Studded Leather Armor    |        1 |        45 |           13 |                 13 |              45 |
  | Whip                     |        1 |         2 |            3 |                  3 |               2 |
  | Light Crossbow           |        1 |        25 |            5 |                  5 |              25 |
  | Bolts                    |       20 |           |              |                  0 |               0 |
  | Thieves tools            |        1 |           |              |                  0 |               0 |
  | Dungeoneer's Pack        |        1 |           |              |                  0 |               0 |
  | Map to a ruin or dungeon |        1 |           |              |                    |                 |
  | Bullseye lantern         |          |           |              |                    |                 |
  | Miner's Pick             |          |           |              |                    |                 |
  | Traveler's clothes       |          |           |              |                    |                 |
  | Shovel                   |          |           |              |                    |                 |
  | 2 person tent            |          |           |              |                    |                 |
  |--------------------------+----------+-----------+--------------+--------------------+-----------------|
  | Carry Capacity           |          |           |              |                  0 |               0 |
  #+TBLFM: $5=($2 * $4)
  #+TBLFM: $6=($2 * $3)
  #+TBLFM: @35$5=vsum(@2$5..@35$5)
  #+TBLFM: @35$6=vsum(@2$6..@34$6)
  #+TBLFM: @35$2=($STR * 10)

** Cloak of Displacement
   While you wear this cloak, it projects an Illusion that makes you appear to be standing in a place 
   near your actual Location, causing any creature to have disadvantage on Attack rolls against you. 
   If you take damage, the property ceases to function until the start of your next turn. This 
   property is suppressed while you are Incapacitated, Restrained, or otherwise unable to move.
 
** Money
   | Copper | Silver | Electrum | Gold | Platinum | Total (Gold) |
   |--------+--------+----------+------+----------+--------------|
   |      0 |      0 |        0 |   10 |        0 |            0 |
   #+TBLFM: $6=(($1 / 100) + ($2 / 10) + ($3 / 2) + $4 + ($5 * 10)) 

